import streamlit as st

st.title("其它杂谈")
st.sidebar.title("其它杂谈")
st.write("这一部分主要收录单个话题内容不多的话题，每个副标题为不同的话题。")
st.sidebar.write("1.我的理性HiFi经历")
st.sidebar.write("2.手机游戏的画质和性能要求问题")
st.subheader("1.我的理性HiFi经历", divider=True)
st.write("我选择耳机与其它数码产品一样都注重性价比。开始时家长找朋友帮我选的耳机是拜亚dt240pro，我搭配了功率100多mW的解码耳放线，实际上这个功率够用了。后来因为我的拜亚dt240pro出了故障并且想要换在古典乐和电影上表现更好的耳机，参考多个客观测试以及用户的反馈后选了飞利浦x2hr，基本满足需求。在电影上除了声场和超低频差一点外，已经接近电影院的音频效果。")
st.write("考虑无线化后，音频发送方案改为使用支持aptx hd和aptx ll的蓝牙音频适配器，在手机则直接使用ldac，接收使用蓝牙耳放，证明了音频质量受录制和后期条件而非码率影响。另外考虑到声场较大的耳机在两声道lores音频表现差一些、有降噪需求以及新型号提升不大，选了索尼wh1000xm3作为降噪耳机。")
st.write("我使用入耳式耳机有耳压问题，尝试过外出使用半入耳式蓝牙耳机比较容易掉，最后决定入手了达音科alpha3。尝试使用功率30mW的更便携的解码耳放线但效果差一些，还是换回原来的，可能是因为灵敏度接近的耳机无论大小都有相近的功率需求或者是解码能力的差距。")
st.subheader("2.手机游戏的画质和性能要求问题", divider=True)
st.write("原神曾经诞生了“感觉画质不如原神”的梗，但个人感觉安卓版本画质还不算好，到了崩坏：星穹铁道才算是有高画质的开放世界游戏。对于非开放世界游戏，性能门槛低不少，这里就不进一步讨论。我的手机的处理器是骁龙8gen1，使用散热器的话玩崩坏：星穹铁道虽然不能满帧但也算流畅。")
st.write("相比原神，崩坏：星穹铁道的地图规模较小。地图规模大并且最早做到高画质的手机游戏是鸣潮，但我运行的时候虽然平均帧率正常，但经常出现卡顿，即使降低画质也无法完全解决，原因尚不明确。后面出的绝区零在箱庭类游戏做到了更高的画质，但也有类似的卡顿问题。")
